backend/SISNET/extracted/ejemplos/ejemplos/ejemplo eFactura.txt

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header/>
   <S:Body>
      <ns2:recepcionCFE xmlns:ns2="http://webServices.sitioWeb.crp.com/">
         <wsCAE>
            <errorDes/>
            <hayError>false</hayError>
            <idInterno>1500001</idInterno>
            <numero>1</numero>
            <numeroAutorizacion>90170001110</numeroAutorizacion>
            <serie>B</serie>
         </wsCAE>
         <wsVarios>
            <comprobanteTipo>e_Factura</comprobanteTipo>
            <fchEmis>16/02/2017</fchEmis>
            <fchVenc>16/02/2017</fchVenc>
            <fmaPago>1</fmaPago>
            <mntBruto>1</mntBruto>
            <nro>27530</nro>
            <nroReferencia>90160001010</nroReferencia>
            <serie>B</serie>
         </wsVarios>
         <wsReceptor>
            <ciudadRecep/>
            <codPaisRecep>UY</codPaisRecep>
            <deptoRecep/>
            <dirRecep>26 de Marzo 1278 ap 202</dirRecep>
            <docRecep>210958750017</docRecep>
            <rznSocRecep>JUAN PEREZ</rznSocRecep>
            <tipoDocRecep>2</tipoDocRecep>
         </wsReceptor>
         <wsTotales>
            <cantLinDet>1</cantLinDet>
            <mntIVATasaBas>22</mntIVATasaBas>
            <mntIVATasaMin>0</mntIVATasaMin>
            <mntNetoIvaTasaBasica>100</mntNetoIvaTasaBasica>
            <mntNetoIvaTasaMin>0</mntNetoIvaTasaMin>
            <mntNoGrv>0</mntNoGrv>
            <mntPagar>122</mntPagar>
            <mntTotal>122</mntTotal>
            <mntPagar>122</mntPagar>
            <montoNF>0</montoNF>
            <tpoMoneda>USD</tpoMoneda>
            <iVATasaBas>tasa_basica</iVATasaBas>
            <iVATasaMin>tasa_Minima</iVATasaMin>
            <tpoCambio>28.0</tpoCambio>
         </wsTotales>
         <listaWsItems>
            <cantidad>1</cantidad>
            <indFact>3</indFact>
            <montoItem>122</montoItem>
            <nomItem>ITEM 1</nomItem>
            <nroLinDet>1</nroLinDet>
            <precioUnitario>122</precioUnitario>
            <uniMed>N/A</uniMed>
         </listaWsItems>
         <listaWsAdendas>
            <ordinal>1</ordinal>
            <etiqueta>TIPOYNUMERO</etiqueta>
            <valor>NUMERO INTERNO : AAA / 1234</valor>
         </listaWsAdendas>
         <listaWsAdendas>
            <ordinal>2</ordinal>
            <etiqueta>OBSERVACION</etiqueta>
            <valor>OBSERVACION : Wservice Sisnet Ejemplo</valor>
         </listaWsAdendas>
         <impresionImprimirSiNo>N</impresionImprimirSiNo>
         <impresionImpresora/>
         <impresionFormato/>
         <impresionNumeroVias>0</impresionNumeroVias>
      </ns2:recepcionCFE>
   </S:Body>
</S:Envelope>